'''
Императивная vs Декларативная парадигма:
Опишите задачу на Python, решение которой может быть 
представлено как императивное решение и как 
декларативное решение. Объясните, в чем различие 
между двумя подходами и какой из них предпочтительнее 
в данном случае.


Тот же калькулятор можно представить как императивное решение и как 
декларативное решение. 
Для того чтобы понимать как работает калькулятор нужно использовать императивное решение, 
если процесс создания и углубленное понимание не столь важно, 
то лучше и быстрее использовать декларативное.

'''